In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("D:\\Developer\\Python\\datasets\\stock_data.csv")

In [3]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [4]:
df2 = pd.read_csv("D:\\Developer\\Python\\datasets\\weather.csv")
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

<h2>Skipping rows while reading csv</h2>

In [5]:
df2 = pd.read_csv("D:\\Developer\\Python\\datasets\\weather.csv", skiprows = 1)
df2

   1/1/2017  32  6   Rain
0  1/2/2017  35  7  Sunny
1  1/3/2017  28  2   Snow

<h2>Skipping rows using the 'header' keyword</h2>

In [6]:
df2 = pd.read_csv("D:\\Developer\\Python\\datasets\\weather.csv", header = 1)
df2

   1/1/2017  32  6   Rain
0  1/2/2017  35  7  Sunny
1  1/3/2017  28  2   Snow

<h2>Creating new column names above the existing columns</h2>

In [7]:
df2 = pd.read_csv("D:\\Developer\\Python\\datasets\\weather.csv", header = None, names = ['date', 'temp', 'wind_speed', 'event'])
df2

       date         temp wind_speed  event
0       day  temperature  windspeed  event
1  1/1/2017           32          6   Rain
2  1/2/2017           35          7  Sunny
3  1/3/2017           28          2   Snow

<h2>Creating new column names and skipping the existing column headers</h2>

In [8]:
df2 = pd.read_csv("D:\\Developer\\Python\\datasets\\weather.csv", skiprows = 1, header = None, names = ['date', 'temp', 'wind_speed', 'event'])
df2

       date  temp  wind_speed  event
0  1/1/2017    32           6   Rain
1  1/2/2017    35           7  Sunny
2  1/3/2017    28           2   Snow

In [9]:
df2 = pd.read_csv("D:\\Developer\\Python\\datasets\\weather.csv", nrows = 1)
df2

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain

In [10]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

<h2>Changing all the different null values as shown above to 'NaN' values as shown below</h2>

In [11]:
df = pd.read_csv("D:\\Developer\\Python\\datasets\\stock_data.csv", na_values = ['not available', 'n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

<h2>revenue can not be negative, it must be 0 or greater. Hence, we need to replace that with NaN. Here's how</h2>

In [12]:
df = pd.read_csv("D:\\Developer\\Python\\datasets\\stock_data.csv", na_values = {
    'eps': ['not available', 'n.a.'],
    'revenue': ['not available', 'n.a.', -1],
    'price': ['not available', 'n.a.'],
    'people': ['not available', 'n.a.']
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

<h2>Writing to a csv file or exporting a new csv file</h2>

In [13]:
df.to_csv('updated_stock_data.csv')

<h2>Exporting csv file without the index column</h2>

In [21]:
df.to_csv('datasets\\updated_stock_data.csv', index = False)

In [16]:
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [26]:
df.to_excel('datasets\\stock_data.xlsx', index = False)

<h2>Filling missing value</h2>

In [39]:
def convert_people_cell(cell):
    if cell == "NaN":
        return 'sam walton'
    return cell

def convert_eps_cell(cell):
    if cell == "NaN":
        return 'Nothing here'
    return cell

df2 = pd.read_excel('datasets\\stock_data.xlsx', 'Sheet1', converters = {
    'people': convert_people_cell,
    'eps': convert_eps_cell
})

In [41]:
df2

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT     -1     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA    5.6      NaN     NaN     ratan tata

<h2>Creating an excel file with two dataframes in two different sheets</h2>

In [44]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64],
    'pe': [30.37, 14.26,30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather = pd.DataFrame({
    'day': ['1/1/2023', '1/2/2023', '1/3/2023'],
    'temperature': [32, 35, 28],
    'event': ['Rain', 'Sunny', 'Snow']
})

In [45]:
with pd.ExcelWriter('datasets\\stocks_weather.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name = 'Stocks')
    df_weather.to_excel(writer, sheet_name = 'Weather')